src/cf/Catalogs/QIWI_АдаптерСообщенияВходящие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>QIWI_АдаптерСообщенияВходящие</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Comment>GUID как строка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторВоВнешнейСистеме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QIWI_АдаптерТипВходящегоСообщения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальноеВремяСоздания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаСвязанныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.QIWI_АдаптерОбъектыОбмена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.QIWI_АдаптерВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QIWI_АдаптерСостоянияВходящих</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетчикПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СвязанныеСообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СвязанноеСообщение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.QIWI_АдаптерСообщенияИсходящие</v8:Type>
								<v8:Type>cfg:CatalogRef.QIWI_АдаптерСообщенияВходящие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗагружаемыеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектОбмена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.QIWI_АдаптерОбъектыОбмена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/QIWI_АдаптерДанныеВФорматеТранспорта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>QIWI_АдаптерДанныеВФорматеТранспорта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДанныеОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QIWI_АдаптерСообщенияИсходящие</v8:Type>
						<v8:Type>cfg:CatalogRef.QIWI_АдаптерСообщенияВходящие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/QIWI_АдаптерСообщенияИсходящие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>QIWI_АдаптерСообщенияИсходящие</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Comment>GUID как строка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.QIWI_АдаптерТипИсходящегоСообщения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальноеВремяСоздания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаСвязанныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.QIWI_АдаптерОбъектыОбмена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.QIWI_АдаптерВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.QIWI_АдаптерСостоянияИсходящих</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСвязанногоСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетчикПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольныеДанные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СвязанныеСообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СвязанноеСообщение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.QIWI_АдаптерСообщенияИсходящие</v8:Type>
								<v8:Type>cfg:CatalogRef.QIWI_АдаптерСообщенияВходящие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыгружаемыеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектОбмена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.QIWI_АдаптерОбъектыОбмена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/QIWI_АдаптерСообщенияВходящие/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтобразитьПредставлениеДанных();
	
	УстановитьОтборыДинамическихСписков();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПредставлениеДанных <> "" Тогда
		
		ДанныеСжато = Новый ХранилищеЗначения(ПредставлениеДанных, Новый СжатиеДанных(9));
		
		МенеджерЗаписей = РегистрыСведений.QIWI_АдаптерДанныеВФорматеТранспорта.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.Сообщение = ТекущийОбъект.Ссылка;		
		МенеджерЗаписей.ДанныеОбмена = ДанныеСжато;
		
		МенеджерЗаписей.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПредставлениеДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	ОтобразитьПредставлениеДанных();	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеДанныхПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвязьСДругимиСообщениямиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если ТекДанные.Ссылка = Объект.Ссылка Тогда
			Возврат;			
		ИначеЕсли ТипЗнч(ТекДанные.Ссылка) = Тип("СправочникСсылка.QIWI_АдаптерСообщенияИсходящие") Тогда
			ПараметрыОткрытия = Новый Структура("Ключ", ТекДанные.Ссылка);
			ОткрытьФорму("Справочник.QIWI_АдаптерСообщенияИсходящие.Форма.ФормаЭлемента", ПараметрыОткрытия);
		ИначеЕсли ТипЗнч(ТекДанные.Ссылка) = Тип("СправочникСсылка.QIWI_АдаптерСообщенияВходящие") Тогда
			ПараметрыОткрытия = Новый Структура("Ключ", ТекДанные.Ссылка);
			ОткрытьФорму("Справочник.QIWI_АдаптерСообщенияВходящие.Форма.ФормаЭлемента", ПараметрыОткрытия);
		Иначе	
			Возврат;
		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СвязьСДругимиСообщениямиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СвязьСДругимиСообщениями.ТекущиеДанные;
	ВыбранноеСообщение = ?(ТекущиеДанные <> Неопределено, ТекущиеДанные.Ссылка, Неопределено);
	УстановитьПараметрВИсторииСообщенияСервер(ВыбранноеСообщение);
	УстановитьПараметрВЗаписиОчереди(ВыбранноеСообщение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрВИсторииСообщенияСервер(ЭлементОтбора = Неопределено)
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Объект.Ссылка;
	КонецЕсли;
	
	ПараметрТекущаяСсылка = ИсторияВыбранногоСообщения.Параметры.Элементы.Найти("ВыбранноеСообщение");
	ПараметрТекущаяСсылка.Использование = Истина;
	ПараметрТекущаяСсылка.Значение = ЭлементОтбора;	
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьПараметрВЗаписиОчереди(ЭлементОтбора = Неопределено)
	
	Если ЭлементОтбора = Неопределено Тогда
		ЭлементОтбора = Объект.Ссылка;
	КонецЕсли;
	
	ПараметрТекущаяСсылка = ЗаписьВИсходящейОчереди.Параметры.Элементы.Найти("ВыбранноеСообщение");
	ПараметрТекущаяСсылка.Использование = Истина;
	ПараметрТекущаяСсылка.Значение = ЭлементОтбора;
	
	ПараметрТекущаяСсылка = ЗаписьВоВходящейОчереди.Параметры.Элементы.Найти("ВыбранноеСообщение");
	ПараметрТекущаяСсылка.Использование = Истина;
	ПараметрТекущаяСсылка.Значение = ЭлементОтбора;  
	
	Если ТипЗнч(ЭлементОтбора) = Тип("СправочникСсылка.QIWI_АдаптерСообщенияИсходящие") Тогда
		Элементы.ЗаписьВИсходящейОчереди.Видимость = Истина;
		Элементы.ЗаписьВоВходящейОчереди.Видимость = Ложь;
	Иначе
		Элементы.ЗаписьВИсходящейОчереди.Видимость = Ложь;
		Элементы.ЗаписьВоВходящейОчереди.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияВыбранногоСообщенияПриАктивизацииСтроки(Элемент)
	УстановитьТекстОписанияСобытия();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстОписанияСобытия()
	
	ТекущиеДанные = Элементы.ИсторияВыбранногоСообщения.ТекущиеДанные;
	ТекстОписанияСобытия = ?(ТекущиеДанные <> Неопределено, ТекущиеДанные.ОписаниеСобытия, "");	
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьПредставлениеДанных()
	
	Если Не Параметры.Ключ.Пустая() Тогда
				
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	QIWI_АдаптерДанныеВФорматеТранспорта.ДанныеОбмена КАК ДанныеОбмена,
		|	QIWI_АдаптерДанныеВФорматеТранспорта.ОписаниеФормата КАК ОписаниеФормата
		|ИЗ
		|	РегистрСведений.QIWI_АдаптерДанныеВФорматеТранспорта КАК QIWI_АдаптерДанныеВФорматеТранспорта
		|ГДЕ
		|	QIWI_АдаптерДанныеВФорматеТранспорта.Сообщение = &Сообщение";
		Запрос.УстановитьПараметр("Сообщение", Объект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ОписаниеФормата = Выборка.ОписаниеФормата;
			ДанныеЗаписи = Выборка.ДанныеОбмена.Получить(); 
					
			Если ЗначениеЗаполнено(ДанныеЗаписи) Тогда
				Если ТипЗнч(ДанныеЗаписи) = Тип("Строка") Тогда 
					ПредставлениеДанных = ДанныеЗаписи;
				Иначе
					Элементы.ПредставлениеДанных.ПодсказкаВвода = "Данные не в строковом формате";				
				КонецЕсли;
			Иначе
				Элементы.ПредставлениеДанных.ПодсказкаВвода = "Нет данных для отображения";	
			КонецЕсли;			
		КонецЕсли; 		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыДинамическихСписков()
	
	ПараметрТекущаяСсылка = СвязьСДругимиСообщениями.Параметры.Элементы.Найти("ТекущаяСсылка");
	ПараметрТекущаяСсылка.Использование = Истина;
	ПараметрТекущаяСсылка.Значение = Объект.Ссылка;
	
	ПараметрСвязанныйОбъект = СвязьСДругимиСообщениями.Параметры.Элементы.Найти("СсылкаНаСвязанныйОбъект");
	ПараметрСвязанныйОбъект.Использование = Истина;
	Если ЗначениеЗаполнено(Объект.СсылкаНаСвязанныйОбъект) Тогда
		ЗначениеПараметра = Объект.СсылкаНаСвязанныйОбъект;
	Иначе
		ЗначениеПараметра = "";
	КонецЕсли;
	ПараметрСвязанныйОбъект.Значение = ЗначениеПараметра;
		
КонецПроцедуры	

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);	
	Диалог.Заголовок 				= "Выберите файл";	
	Диалог.Фильтр					= "Текстовый (*.txt)|*.txt|XML (*.xml)|*.xml|JSON (*.json)|*.json|ALL (*.*)|*.*"; 
	Диалог.Расширение				= "txt,xml,json,all";
	Диалог.ПредварительныйПросмотр 	= Ложь;
	Диалог.ИндексФильтра 			= 0;
	Диалог.ПолноеИмяФайла 			= Объект.ИдентификаторСообщения; 		
	Диалог.МножественныйВыбор 		= Ложь;
	
	Если НЕ Диалог.Выбрать() Тогда
		Возврат;
	КонецЕсли;	
	
	ПолноеИмяФайла = Диалог.ПолноеИмяФайла;
	       	
	ЗаписьДанных = Новый ЗаписьДанных(ПолноеИмяФайла);
	ЗаписьДанных.ЗаписатьСтроку(ПредставлениеДанных);
	ЗаписьДанных.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаBase64КакТекстПриИзменении(Элемент)
	
	Если СтрокаBase64КакТекст Тогда		
		Попытка
			ДвоичныеДанныеСтроки = Base64Значение(ПредставлениеДанных);
			ПредставлениеДанных = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеСтроки);			
		Исключение
			СтрокаBase64КакТекст = Ложь;
		КонецПопытки;
	Иначе
		ОтобразитьПредставлениеДанных();
	КонецЕсли;
	
	Элементы.ПредставлениеДанных.ТолькоПросмотр = СтрокаBase64КакТекст;

КонецПроцедуры
 
#КонецОбласти
